{"format": "graph-model", "generatedBy": "2.19.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"input": {"name": "input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "270"}, {"size": "480"}, {"size": "3"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1080"}, {"size": "1920"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "unknown_80", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "unknown_74", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}}}, {"name": "unknown_75", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_76", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_78", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "unknown_79", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/tf.math.multiply_74/Mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.multiply_69/Mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "PartitionedCall/model/tf.math.multiply_64/Mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "unknown_61", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_62", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "ConstantFolding/PartitionedCall/model/tf.math.divide_8/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_63", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "unknown_64", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_65", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/PartitionedCall/model/tf.math.divide_9/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "unknown_66", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "unknown_67", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}}}}}, {"name": "unknown_68", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/PartitionedCall/model/tf.math.divide_10/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_69", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.multiply_56/Mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "unknown_55", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown_56", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "PartitionedCall/model/tf.strided_slice_2/ones_like", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "ConstantFolding/PartitionedCall/model/tf.math.divide_7/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_57", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "unknown_50", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "unknown_44", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}}}, {"name": "unknown_45", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "unknown_46", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_48", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_49", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "PartitionedCall/model/tf.math.multiply_44/Mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.multiply_39/Mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.multiply_34/Mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_31", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}}}}}, {"name": "unknown_32", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/PartitionedCall/model/tf.math.divide_4/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "unknown_33", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "unknown_34", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}}}}}, {"name": "unknown_35", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/PartitionedCall/model/tf.math.divide_5/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_36", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "unknown_37", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}}}}}, {"name": "unknown_38", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "ConstantFolding/PartitionedCall/model/tf.math.divide_6/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "unknown_39", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "PartitionedCall/model/tf.math.multiply_26/Mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "unknown_25", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown_26", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model/tf.strided_slice/ones_like", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "ConstantFolding/PartitionedCall/model/tf.math.divide_3/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "unknown_27", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_14", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}}}, {"name": "unknown_15", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_16", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}}}, {"name": "unknown_18", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_19", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "PartitionedCall/model/tf.math.multiply_14/Mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "PartitionedCall/model/tf.math.multiply_9/Mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.multiply_4/Mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}}}}}, {"name": "unknown_2", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "ConstantFolding/PartitionedCall/model/tf.math.divide/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_3", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "unknown_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_5", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "ConstantFolding/PartitionedCall/model/tf.math.divide_1/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "unknown_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_7", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}}}}}, {"name": "unknown_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/PartitionedCall/model/tf.math.divide_2/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "unknown_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_10", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "48"}]}}}}}, {"name": "unknown_11", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "unknown_12", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_13", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_17", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "16"}]}}}}}, {"name": "unknown_20", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_21", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "48"}]}}}}}, {"name": "unknown_22", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_23", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "254"}]}}}}}, {"name": "unknown_24", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "254"}, {"size": "1"}]}}}}}, {"name": "unknown_28", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown_29", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "PartitionedCall/model/tf.strided_slice_1/ones_like", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "unknown_30", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "127"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_40", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "48"}]}}}}}, {"name": "unknown_41", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "unknown_42", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "16"}]}}}}}, {"name": "unknown_43", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_47", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "16"}]}}}}}, {"name": "unknown_51", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_52", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_53", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "254"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_54", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "254"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_58", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown_59", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model/tf.strided_slice_3/ones_like", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "unknown_60", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "127"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_70", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_71", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_72", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "16"}]}}}}}, {"name": "unknown_73", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "unknown_77", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "16"}]}}}}}, {"name": "unknown_81", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "48"}]}}}}}, {"name": "unknown_82", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "unknown_83", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_84", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_85", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}}}}}, {"name": "unknown_86", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.reshape/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "6"}]}}}}}, {"name": "PartitionedCall/model/tf.compat.v1.transpose/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "6"}]}}}}}, {"name": "PartitionedCall/model/output/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "270"}, {"size": "480"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.add/Add", "op": "_FusedConv2D", "input": ["input", "unknown", "unknown_0"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "filter_format": {"s": "SFdJTw=="}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "num_host_args": {"i": "0"}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "leakyrelu_alpha": {"f": 0.2}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-5"}, {"size": "-6"}, {"size": "-7"}, {"size": "-8"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "48"}]}]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}}}, {"name": "PartitionedCall/model/tf.math.add_1/Add", "op": "_FusedConv2D", "input": ["PartitionedCall/model/tf.math.add/Add", "unknown_1", "unknown_2"], "device": "/device:CPU:0", "attr": {"TArgs": {"list": {"type": ["DT_FLOAT"]}}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "data_format": {"s": "TkhXQw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-5"}, {"size": "-6"}, {"size": "-7"}, {"size": "48"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "filter_format": {"s": "SFdJTw=="}, "num_host_args": {"i": "0"}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "PartitionedCall/model/tf.math.multiply_2/Mul", "op": "Mul", "input": ["PartitionedCall/model/tf.math.multiply_4/Mul/y", "PartitionedCall/model/tf.math.add_1/Add"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "PartitionedCall/model/tf.math.divide/truediv", "op": "Mul", "input": ["PartitionedCall/model/tf.math.add_1/Add", "ConstantFolding/PartitionedCall/model/tf.math.divide/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.erf/Erf", "op": "Erf", "input": ["PartitionedCall/model/tf.math.divide/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.add_3/Add", "op": "AddV2", "input": ["PartitionedCall/model/tf.math.erf/Erf", "unknown_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.multiply_4/Mul", "op": "Mul", "input": ["PartitionedCall/model/tf.math.multiply_2/Mul", "PartitionedCall/model/tf.math.add_3/Add"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.add_4/Add", "op": "_FusedConv2D", "input": ["PartitionedCall/model/tf.math.multiply_4/Mul", "unknown_4", "unknown_5"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.2}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-5"}, {"size": "-6"}, {"size": "-7"}, {"size": "48"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "filter_format": {"s": "SFdJTw=="}}}, {"name": "PartitionedCall/model/tf.math.multiply_7/Mul", "op": "Mul", "input": ["PartitionedCall/model/tf.math.multiply_9/Mul/y", "PartitionedCall/model/tf.math.add_4/Add"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "PartitionedCall/model/tf.math.divide_1/truediv", "op": "Mul", "input": ["PartitionedCall/model/tf.math.add_4/Add", "ConstantFolding/PartitionedCall/model/tf.math.divide_1/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.erf_1/Erf", "op": "Erf", "input": ["PartitionedCall/model/tf.math.divide_1/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.add_6/Add", "op": "AddV2", "input": ["PartitionedCall/model/tf.math.erf_1/Erf", "unknown_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.multiply_9/Mul", "op": "Mul", "input": ["PartitionedCall/model/tf.math.multiply_7/Mul", "PartitionedCall/model/tf.math.add_6/Add"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "PartitionedCall/model/tf.math.add_7/Add", "op": "_FusedConv2D", "input": ["PartitionedCall/model/tf.math.multiply_9/Mul", "unknown_7", "unknown_8"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-5"}, {"size": "-6"}, {"size": "-7"}, {"size": "48"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}]}}, "num_host_args": {"i": "0"}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "filter_format": {"s": "SFdJTw=="}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}}}, {"name": "PartitionedCall/model/tf.math.multiply_12/Mul", "op": "Mul", "input": ["PartitionedCall/model/tf.math.multiply_14/Mul/y", "PartitionedCall/model/tf.math.add_7/Add"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "PartitionedCall/model/tf.math.divide_2/truediv", "op": "Mul", "input": ["PartitionedCall/model/tf.math.add_7/Add", "ConstantFolding/PartitionedCall/model/tf.math.divide_2/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.erf_2/Erf", "op": "Erf", "input": ["PartitionedCall/model/tf.math.divide_2/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.add_9/Add", "op": "AddV2", "input": ["PartitionedCall/model/tf.math.erf_2/Erf", "unknown_9"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.multiply_14/Mul", "op": "Mul", "input": ["PartitionedCall/model/tf.math.multiply_12/Mul", "PartitionedCall/model/tf.math.add_9/Add"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.add_10/Add", "op": "AddV2", "input": ["PartitionedCall/model/tf.math.multiply_14/Mul", "PartitionedCall/model/tf.math.add/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.add_11/Add", "op": "_FusedConv2D", "input": ["PartitionedCall/model/tf.math.add_10/Add", "unknown_10", "unknown_11"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "num_host_args": {"i": "0"}, "leakyrelu_alpha": {"f": 0.2}, "padding": {"s": "U0FNRQ=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-5"}, {"size": "-6"}, {"size": "-7"}, {"size": "48"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "48"}]}]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model/tf.math.add_12/Add", "op": "_FusedConv2D", "input": ["PartitionedCall/model/tf.math.add_11/Add", "unknown_12", "unknown_13"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "use_cudnn_on_gpu": {"b": true}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-5"}, {"size": "-6"}, {"size": "-7"}, {"size": "48"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "16"}]}]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "filter_format": {"s": "SFdJTw=="}, "num_host_args": {"i": "0"}}}, {"name": "PartitionedCall/model/tf.math.add_13/Add", "op": "_FusedConv2D", "input": ["PartitionedCall/model/tf.math.add_12/Add", "unknown_14", "unknown_15"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "leakyrelu_alpha": {"f": 0.2}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "num_host_args": {"i": "0"}, "use_cudnn_on_gpu": {"b": true}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-5"}, {"size": "-6"}, {"size": "-7"}, {"size": "16"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}]}}}}, {"name": "PartitionedCall/model/tf.math.add_14/Add", "op": "_FusedConv2D", "input": ["PartitionedCall/model/tf.math.add_12/Add", "unknown_17", "unknown_20"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "filter_format": {"s": "SFdJTw=="}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-5"}, {"size": "-6"}, {"size": "-7"}, {"size": "16"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "16"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "leakyrelu_alpha": {"f": 0.2}}}, {"name": "PartitionedCall/model/tf.nn.max_pool2d/MaxPool2d", "op": "MaxPool", "input": ["PartitionedCall/model/tf.math.add_13/Add"], "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "3", "3", "1"]}}, "ksize": {"list": {"i": ["1", "7", "7", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}}}, {"name": "PartitionedCall/model/tf.math.add_15/Add", "op": "_FusedConv2D", "input": ["PartitionedCall/model/tf.nn.max_pool2d/MaxPool2d", "unknown_16", "unknown_18"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-5"}, {"size": "-11"}, {"size": "-12"}, {"size": "16"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}]}}, "use_cudnn_on_gpu": {"b": true}, "num_host_args": {"i": "0"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.image.resize/resize/ResizeBilinear", "op": "ResizeBilinear", "input": ["PartitionedCall/model/tf.math.add_15/Add", "unknown_19"], "attr": {"T": {"type": "DT_FLOAT"}, "align_corners": {"b": false}, "half_pixel_centers": {"b": true}}}, {"name": "PartitionedCall/model/tf.math.add_16/Add", "op": "AddV2", "input": ["PartitionedCall/model/tf.image.resize/resize/ResizeBilinear", "PartitionedCall/model/tf.math.add_14/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.add_17/Add", "op": "_FusedConv2D", "input": ["PartitionedCall/model/tf.math.add_16/Add", "unknown_21", "unknown_22"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-5"}, {"size": "270"}, {"size": "480"}, {"size": "16"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "48"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "explicit_paddings": {"list": {}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "leakyrelu_alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}, "num_host_args": {"i": "0"}}}, {"name": "PartitionedCall/model/tf.math.sigmoid/Sigmoid", "op": "Sigmoid", "input": ["PartitionedCall/model/tf.math.add_17/Add"], "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-5"}, {"size": "270"}, {"size": "480"}, {"size": "48"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.multiply_21/Mul", "op": "Mul", "input": ["PartitionedCall/model/tf.math.add_11/Add", "PartitionedCall/model/tf.math.sigmoid/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.nn.convolution_10/convolution", "op": "Conv2D", "input": ["PartitionedCall/model/tf.math.multiply_21/Mul", "unknown_23"], "device": "/device:CPU:0", "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-5"}, {"size": "270"}, {"size": "480"}, {"size": "48"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "254"}]}]}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}}}, {"name": "PartitionedCall/model/tf.compat.v1.nn.depthwise_conv2d/depthwise", "op": "DepthwiseConv2dNative", "input": ["PartitionedCall/model/tf.nn.convolution_10/convolution", "unknown_24"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-5"}, {"size": "270"}, {"size": "480"}, {"size": "254"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "254"}, {"size": "1"}]}]}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}}}, {"name": "PartitionedCall/model/tf.strided_slice/StridedSlice", "op": "StridedSlice", "input": ["PartitionedCall/model/tf.compat.v1.nn.depthwise_conv2d/depthwise", "unknown_25", "unknown_26", "PartitionedCall/model/tf.strided_slice/ones_like"], "attr": {"T": {"type": "DT_FLOAT"}, "begin_mask": {"i": "15"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT64"}, "end_mask": {"i": "7"}, "new_axis_mask": {"i": "0"}}}, {"name": "PartitionedCall/model/tf.strided_slice_1/StridedSlice", "op": "StridedSlice", "input": ["PartitionedCall/model/tf.compat.v1.nn.depthwise_conv2d/depthwise", "unknown_28", "unknown_29", "PartitionedCall/model/tf.strided_slice_1/ones_like"], "attr": {"T": {"type": "DT_FLOAT"}, "end_mask": {"i": "7"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "7"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model/tf.math.multiply_24/Mul", "op": "Mul", "input": ["PartitionedCall/model/tf.math.multiply_26/Mul/y", "PartitionedCall/model/tf.strided_slice/StridedSlice"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.divide_3/truediv", "op": "Mul", "input": ["PartitionedCall/model/tf.strided_slice/StridedSlice", "ConstantFolding/PartitionedCall/model/tf.math.divide_3/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.erf_3/Erf", "op": "Erf", "input": ["PartitionedCall/model/tf.math.divide_3/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.add_19/Add", "op": "AddV2", "input": ["PartitionedCall/model/tf.math.erf_3/Erf", "unknown_27"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.multiply_26/Mul", "op": "Mul", "input": ["PartitionedCall/model/tf.math.multiply_24/Mul", "PartitionedCall/model/tf.math.add_19/Add"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.multiply_29/Mul", "op": "Mul", "input": ["PartitionedCall/model/tf.math.multiply_26/Mul", "PartitionedCall/model/tf.strided_slice_1/StridedSlice"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.nn.convolution_11/convolution", "op": "Conv2D", "input": ["PartitionedCall/model/tf.math.multiply_29/Mul", "unknown_30"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "270"}, {"size": "480"}, {"size": "127"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "127"}, {"size": "48"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "PartitionedCall/model/tf.math.add_20/Add", "op": "_FusedConv2D", "input": ["PartitionedCall/model/tf.nn.convolution_11/convolution", "unknown_31", "unknown_32"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "filter_format": {"s": "SFdJTw=="}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "T": {"type": "DT_FLOAT"}, "num_host_args": {"i": "0"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "leakyrelu_alpha": {"f": 0.2}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "270"}, {"size": "480"}, {"size": "48"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}]}}}}, {"name": "PartitionedCall/model/tf.math.multiply_32/Mul", "op": "Mul", "input": ["PartitionedCall/model/tf.math.multiply_34/Mul/y", "PartitionedCall/model/tf.math.add_20/Add"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "PartitionedCall/model/tf.math.divide_4/truediv", "op": "Mul", "input": ["PartitionedCall/model/tf.math.add_20/Add", "ConstantFolding/PartitionedCall/model/tf.math.divide_4/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.erf_4/Erf", "op": "Erf", "input": ["PartitionedCall/model/tf.math.divide_4/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.add_22/Add", "op": "AddV2", "input": ["PartitionedCall/model/tf.math.erf_4/Erf", "unknown_33"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.multiply_34/Mul", "op": "Mul", "input": ["PartitionedCall/model/tf.math.multiply_32/Mul", "PartitionedCall/model/tf.math.add_22/Add"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.add_23/Add", "op": "_FusedConv2D", "input": ["PartitionedCall/model/tf.math.multiply_34/Mul", "unknown_34", "unknown_35"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "270"}, {"size": "480"}, {"size": "48"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}]}}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "num_host_args": {"i": "0"}, "filter_format": {"s": "SFdJTw=="}, "leakyrelu_alpha": {"f": 0.2}}}, {"name": "PartitionedCall/model/tf.math.multiply_37/Mul", "op": "Mul", "input": ["PartitionedCall/model/tf.math.multiply_39/Mul/y", "PartitionedCall/model/tf.math.add_23/Add"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.divide_5/truediv", "op": "Mul", "input": ["PartitionedCall/model/tf.math.add_23/Add", "ConstantFolding/PartitionedCall/model/tf.math.divide_5/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.erf_5/Erf", "op": "Erf", "input": ["PartitionedCall/model/tf.math.divide_5/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.add_25/Add", "op": "AddV2", "input": ["PartitionedCall/model/tf.math.erf_5/Erf", "unknown_36"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.multiply_39/Mul", "op": "Mul", "input": ["PartitionedCall/model/tf.math.multiply_37/Mul", "PartitionedCall/model/tf.math.add_25/Add"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "PartitionedCall/model/tf.math.add_26/Add", "op": "_FusedConv2D", "input": ["PartitionedCall/model/tf.math.multiply_39/Mul", "unknown_37", "unknown_38"], "device": "/device:CPU:0", "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "270"}, {"size": "480"}, {"size": "48"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "leakyrelu_alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}, "filter_format": {"s": "SFdJTw=="}, "num_args": {"i": "1"}, "num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "PartitionedCall/model/tf.math.multiply_42/Mul", "op": "Mul", "input": ["PartitionedCall/model/tf.math.multiply_44/Mul/y", "PartitionedCall/model/tf.math.add_26/Add"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.divide_6/truediv", "op": "Mul", "input": ["PartitionedCall/model/tf.math.add_26/Add", "ConstantFolding/PartitionedCall/model/tf.math.divide_6/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.erf_6/Erf", "op": "Erf", "input": ["PartitionedCall/model/tf.math.divide_6/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.add_28/Add", "op": "AddV2", "input": ["PartitionedCall/model/tf.math.erf_6/Erf", "unknown_39"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.multiply_44/Mul", "op": "Mul", "input": ["PartitionedCall/model/tf.math.multiply_42/Mul", "PartitionedCall/model/tf.math.add_28/Add"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.add_29/Add", "op": "AddV2", "input": ["PartitionedCall/model/tf.math.multiply_44/Mul", "PartitionedCall/model/tf.nn.convolution_11/convolution"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.add_30/Add", "op": "_FusedConv2D", "input": ["PartitionedCall/model/tf.math.add_29/Add", "unknown_40", "unknown_41"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "270"}, {"size": "480"}, {"size": "48"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "48"}]}]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "leakyrelu_alpha": {"f": 0.2}, "padding": {"s": "U0FNRQ=="}, "num_host_args": {"i": "0"}, "filter_format": {"s": "SFdJTw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}}}, {"name": "PartitionedCall/model/tf.math.add_31/Add", "op": "_FusedConv2D", "input": ["PartitionedCall/model/tf.math.add_30/Add", "unknown_42", "unknown_43"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "T": {"type": "DT_FLOAT"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "270"}, {"size": "480"}, {"size": "48"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "16"}]}]}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "num_host_args": {"i": "0"}}}, {"name": "PartitionedCall/model/tf.math.add_32/Add", "op": "_FusedConv2D", "input": ["PartitionedCall/model/tf.math.add_31/Add", "unknown_44", "unknown_45"], "device": "/device:CPU:0", "attr": {"TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "num_host_args": {"i": "0"}, "explicit_paddings": {"list": {}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "filter_format": {"s": "SFdJTw=="}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "270"}, {"size": "480"}, {"size": "16"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}]}}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "PartitionedCall/model/tf.nn.convolution_18/convolution", "op": "Conv2D", "input": ["PartitionedCall/model/tf.math.add_31/Add", "unknown_47"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "270"}, {"size": "480"}, {"size": "16"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "16"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "PartitionedCall/model/tf.nn.max_pool2d_1/MaxPool2d", "op": "MaxPool", "input": ["PartitionedCall/model/tf.math.add_32/Add"], "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "3", "3", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": 