{"format": "graph-model", "generatedBy": "2.17.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"args_0": {"name": "args_0:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "360"}, {"size": "640"}, {"size": "3"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1440"}, {"size": "2560"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_7_1/esa_7_1/conv2d_73_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_7_1/esa_7_1/conv2d_73_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_7_1/esa_7_1/conv2d_74_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_7_1/esa_7_1/conv2d_74_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_7_1/esa_7_1/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_7_1/esa_7_1/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_7_1/esa_7_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_7_1/conv2d_67_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "36"}, {"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_7_1/conv2d_67_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_7_1/conv2d_68_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_7_1/conv2d_68_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_7_1/conv2d_69_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "36"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_7_1/conv2d_69_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "36"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_6_1/esa_6_1/conv2d_64_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_6_1/esa_6_1/conv2d_64_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_6_1/esa_6_1/conv2d_65_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_6_1/esa_6_1/conv2d_65_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_6_1/esa_6_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_6_1/esa_6_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_6_1/esa_6_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_6_1/conv2d_58_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "36"}, {"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_6_1/conv2d_58_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_6_1/conv2d_59_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_6_1/conv2d_59_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_6_1/conv2d_60_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "36"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_6_1/conv2d_60_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "36"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/esa_5_1/conv2d_55_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/esa_5_1/conv2d_55_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/esa_5_1/conv2d_56_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/esa_5_1/conv2d_56_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/esa_5_1/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/esa_5_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/esa_5_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/conv2d_49_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "36"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/conv2d_49_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/conv2d_50_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/conv2d_50_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/conv2d_51_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "36"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/conv2d_51_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "36"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/conv2d_46_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/conv2d_46_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/conv2d_47_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/conv2d_47_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/conv2d_40_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "36"}, {"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/conv2d_40_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/conv2d_41_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/conv2d_41_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/conv2d_42_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "36"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/conv2d_42_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "36"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/conv2d_43_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "36"}, {"size": "36"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/conv2d_43_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "36"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/conv2d_44_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "36"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/conv2d_44_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/conv2d_45_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/conv2d_45_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/conv2d_48_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "36"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/conv2d_48_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "36"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/conv2d_52_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "36"}, {"size": "36"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/conv2d_52_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "36"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/esa_5_1/conv2d_53_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "36"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/esa_5_1/conv2d_53_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/esa_5_1/conv2d_54_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/esa_5_1/conv2d_54_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/esa_5_1/conv2d_57_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "36"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/esa_5_1/conv2d_57_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "36"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_6_1/conv2d_61_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "36"}, {"size": "36"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_6_1/conv2d_61_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "36"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_6_1/esa_6_1/conv2d_62_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "36"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_6_1/esa_6_1/conv2d_62_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_6_1/esa_6_1/conv2d_63_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_6_1/esa_6_1/conv2d_63_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_6_1/esa_6_1/conv2d_66_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "36"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_6_1/esa_6_1/conv2d_66_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "36"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_7_1/conv2d_70_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "36"}, {"size": "36"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_7_1/conv2d_70_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "36"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_7_1/esa_7_1/conv2d_71_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "36"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_7_1/esa_7_1/conv2d_71_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_7_1/esa_7_1/conv2d_72_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_7_1/esa_7_1/conv2d_72_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_7_1/esa_7_1/conv2d_75_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "36"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_7_1/esa_7_1/conv2d_75_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "36"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/conv2d_76_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "36"}, {"size": "36"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/conv2d_76_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "36"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/conv2d_39_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "36"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/conv2d_39_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "36"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/sequential_1_1/conv2d_77_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "36"}, {"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/sequential_1_1/conv2d_77_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/mul_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "args_0", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "360"}, {"size": "640"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/conv2d_39_1/BiasAdd", "op": "_FusedConv2D", "input": ["args_0", "StatefulPartitionedCall/light_rlfn_1_1/conv2d_39_1/convolution/ReadVariableOp", "StatefulPartitionedCall/light_rlfn_1_1/conv2d_39_1/Squeeze"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "num_host_args": {"i": "0"}, "padding": {"s": "U0FNRQ=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "-5"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "36"}]}]}}, "leakyrelu_alpha": {"f": 0.2}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/Shape", "op": "Shape", "input": ["args_0"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/Shape_1", "op": "Shape", "input": ["args_0"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/leaky_re_lu_4_1/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/light_rlfn_1_1/conv2d_39_1/BiasAdd", "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/conv2d_40_1/convolution/ReadVariableOp", "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/conv2d_40_1/Squeeze"], "device": "/device:CPU:0", "attr": {"filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "36"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "36"}, {"size": "48"}]}]}}, "explicit_paddings": {"list": {}}, "num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "leakyrelu_alpha": {"f": 0.05}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/light_rlfn_1_1/Shape", "StatefulPartitionedCall/light_rlfn_1_1/strided_slice/stack", "StatefulPartitionedCall/light_rlfn_1_1/strided_slice/stack_1", "StatefulPartitionedCall/light_rlfn_1_1/strided_slice/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/light_rlfn_1_1/Shape_1", "StatefulPartitionedCall/light_rlfn_1_1/strided_slice_1/stack", "StatefulPartitionedCall/light_rlfn_1_1/strided_slice_1/stack_1", "StatefulPartitionedCall/light_rlfn_1_1/strided_slice_1/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/leaky_re_lu_4_3/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/leaky_re_lu_4_1/LeakyRelu", "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/conv2d_41_1/convolution/ReadVariableOp", "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/conv2d_41_1/Squeeze"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.05}, "epsilon": {"f": 0.0}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_host_args": {"i": "0"}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "48"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}]}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/light_rlfn_1_1/strided_slice", "StatefulPartitionedCall/light_rlfn_1_1/mul/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/light_rlfn_1_1/strided_slice_1", "StatefulPartitionedCall/light_rlfn_1_1/mul_1/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/leaky_re_lu_4_5/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/leaky_re_lu_4_3/LeakyRelu", "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/conv2d_42_1/convolution/ReadVariableOp", "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/conv2d_42_1/Squeeze"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "leakyrelu_alpha": {"f": 0.05}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "num_host_args": {"i": "0"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "48"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "36"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/resize/size", "op": "Pack", "input": ["StatefulPartitionedCall/light_rlfn_1_1/mul", "StatefulPartitionedCall/light_rlfn_1_1/mul_1"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/leaky_re_lu_4_5/LeakyRelu", "StatefulPartitionedCall/light_rlfn_1_1/conv2d_39_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/resize/ResizeBilinear", "op": "ResizeBilinear", "input": ["args_0", "StatefulPartitionedCall/light_rlfn_1_1/resize/size"], "attr": {"half_pixel_centers": {"b": true}, "T": {"type": "DT_FLOAT"}, "align_corners": {"b": false}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/conv2d_43_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/add", "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/conv2d_43_1/convolution/ReadVariableOp", "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/conv2d_43_1/Squeeze"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "num_host_args": {"i": "0"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "36"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "36"}, {"size": "36"}]}]}}, "use_cudnn_on_gpu": {"b": true}, "filter_format": {"s": "SFdJTw=="}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/conv2d_43_1/BiasAdd"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/conv2d_44_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/conv2d_43_1/BiasAdd", "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/conv2d_44_1/convolution/ReadVariableOp", "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/conv2d_44_1/Squeeze"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "36"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "36"}, {"size": "16"}]}]}}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "leakyrelu_alpha": {"f": 0.2}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/Shape", "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/strided_slice/stack", "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/strided_slice/stack_1", "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/conv2d_46_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/conv2d_44_1/BiasAdd", "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/conv2d_46_1/convolution/ReadVariableOp", "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/conv2d_46_1/Squeeze"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "num_host_args": {"i": "0"}, "filter_format": {"s": "SFdJTw=="}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "16"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/conv2d_45_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/conv2d_44_1/BiasAdd", "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/conv2d_45_1/convolution/ReadVariableOp", "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/conv2d_45_1/Squeeze"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "filter_format": {"s": "SFdJTw=="}, "use_cudnn_on_gpu": {"b": true}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "16"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "16"}]}]}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/conv2d_46_1/BiasAdd"], "attr": {"padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "7", "7", "1"]}}, "strides": {"list": {"i": ["1", "3", "3", "1"]}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/conv2d_47_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/MaxPool2d", "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/conv2d_47_1/convolution/ReadVariableOp", "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/conv2d_47_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "num_args": {"i": "1"}, "filter_format": {"s": "SFdJTw=="}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-8"}, {"size": "-9"}, {"size": "16"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}]}}, "leakyrelu_alpha": {"f": 0.2}, "padding": {"s": "U0FNRQ=="}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/resize/ResizeBilinear", "op": "ResizeBilinear", "input": ["StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/conv2d_47_1/BiasAdd", "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/strided_slice"], "attr": {"half_pixel_centers": {"b": true}, "T": {"type": "DT_FLOAT"}, "align_corners": {"b": false}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/resize/ResizeBilinear", "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/conv2d_45_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/conv2d_48_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/add", "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/conv2d_48_1/convolution/ReadVariableOp", "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/conv2d_48_1/Squeeze"], "device": "/device:CPU:0", "attr": {"TArgs": {"list": {"type": ["DT_FLOAT"]}}, "T": {"type": "DT_FLOAT"}, "filter_format": {"s": "SFdJTw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-12"}, {"size": "-13"}, {"size": "16"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "36"}]}]}}, "leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_host_args": {"i": "0"}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/activation_4_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/conv2d_48_1/BiasAdd"], "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-12"}, {"size": "-13"}, {"size": "36"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/conv2d_43_1/BiasAdd", "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/activation_4_1/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/leaky_re_lu_5_1/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/mul", "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/conv2d_49_1/convolution/ReadVariableOp", "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/conv2d_49_1/Squeeze"], "device": "/device:CPU:0", "attr": {"filter_format": {"s": "SFdJTw=="}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "num_host_args": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-14"}, {"size": "-15"}, {"size": "36"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "36"}, {"size": "48"}]}]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "leakyrelu_alpha": {"f": 0.05}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/leaky_re_lu_5_3/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/leaky_re_lu_5_1/LeakyRelu", "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/conv2d_50_1/convolution/ReadVariableOp", "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/conv2d_50_1/Squeeze"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-14"}, {"size": "-15"}, {"size": "48"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}]}}, "padding": {"s": "U0FNRQ=="}, "filter_format": {"s": "SFdJTw=="}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "num_host_args": {"i": "0"}, "leakyrelu_alpha": {"f": 0.05}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/leaky_re_lu_5_5/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/leaky_re_lu_5_3/LeakyRelu", "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/conv2d_51_1/convolution/ReadVariableOp", "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/conv2d_51_1/Squeeze"], "device": "/device:CPU:0", "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-14"}, {"size": "-15"}, {"size": "48"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "36"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "leakyrelu_alpha": {"f": 0.05}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "num_host_args": {"i": "0"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/leaky_re_lu_5_5/LeakyRelu", "StatefulPartitionedCall/light_rlfn_1_1/rlfb_4_1/esa_4_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/conv2d_52_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/add", "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/conv2d_52_1/convolution/ReadVariableOp", "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/conv2d_52_1/Squeeze"], "device": "/device:CPU:0", "attr": {"filter_format": {"s": "SFdJTw=="}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_host_args": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-14"}, {"size": "-15"}, {"size": "36"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "36"}, {"size": "36"}]}]}}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/esa_5_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/conv2d_52_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/esa_5_1/conv2d_53_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/conv2d_52_1/BiasAdd", "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/esa_5_1/conv2d_53_1/convolution/ReadVariableOp", "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/esa_5_1/conv2d_53_1/Squeeze"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "filter_format": {"s": "SFdJTw=="}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-14"}, {"size": "-15"}, {"size": "36"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "36"}, {"size": "16"}]}]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_host_args": {"i": "0"}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/esa_5_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/esa_5_1/Shape", "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/esa_5_1/strided_slice/stack", "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/esa_5_1/strided_slice/stack_1", "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/esa_5_1/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/esa_5_1/conv2d_55_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/esa_5_1/conv2d_53_1/BiasAdd", "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/esa_5_1/conv2d_55_1/convolution/ReadVariableOp", "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/esa_5_1/conv2d_55_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "filter_format": {"s": "SFdJTw=="}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-14"}, {"size": "-15"}, {"size": "16"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}]}}, "num_host_args": {"i": "0"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "leakyrelu_alpha": {"f": 0.2}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/esa_5_1/conv2d_54_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/esa_5_1/conv2d_53_1/BiasAdd", "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/esa_5_1/conv2d_54_1/convolution/ReadVariableOp", "StatefulPartitionedCall/light_rlfn_1_1/rlfb_5_1/esa_5_1/conv2d_54_1/Squeeze"], "device": "/device:CPU:0", "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-14"}, {"size": "-15"}, 