{"format": "graph-model", "generatedBy": "2.17.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"args_0": {"name": "args_0:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "240"}, {"size": "320"}, {"size": "3"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "960"}, {"size": "1280"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_2_1/esa_2_1/conv2d_29_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_2_1/esa_2_1/conv2d_29_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_2_1/esa_2_1/conv2d_30_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_2_1/esa_2_1/conv2d_30_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_2_1/esa_2_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_2_1/esa_2_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_2_1/esa_2_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_2_1/esa_2_1/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_2_1/esa_2_1/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_2_1/esa_2_1/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_2_1/activation_5_5/Gelu/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_2_1/activation_5_5/Gelu/add/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_2_1/activation_5_3/Gelu/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_2_1/activation_5_3/Gelu/add/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_2_1/activation_5_1/Gelu/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_2_1/activation_5_1/Gelu/add/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_2_1/conv2d_23_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_2_1/conv2d_23_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/rlfn_mogai_1/rlfb_2_1/activation_5_1/Gelu/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_2_1/conv2d_24_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_2_1/conv2d_24_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/rlfn_mogai_1/rlfb_2_1/activation_5_3/Gelu/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_2_1/conv2d_25_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_2_1/conv2d_25_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/rlfn_mogai_1/rlfb_2_1/activation_5_5/Gelu/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/feed_forward_1_2/Gelu/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/feed_forward_1_2/Gelu/add/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/rlfn_mogai_1/feed_forward_1_2/Gelu/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/feed_forward_1_2/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1_2/esa_1_1/conv2d_18_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1_2/esa_1_1/conv2d_18_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1_2/esa_1_1/conv2d_19_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1_2/esa_1_1/conv2d_19_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1_2/esa_1_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1_2/esa_1_1/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1_2/esa_1_1/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1_2/esa_1_1/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1_2/esa_1_1/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1_2/esa_1_1/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1_2/activation_3_5/Gelu/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1_2/activation_3_5/Gelu/add/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1_2/activation_3_3/Gelu/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1_2/activation_3_3/Gelu/add/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1_2/activation_3_1/Gelu/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1_2/activation_3_1/Gelu/add/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1_2/conv2d_12_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1_2/conv2d_12_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/rlfn_mogai_1/rlfb_1_2/activation_3_1/Gelu/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1_2/conv2d_13_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1_2/conv2d_13_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/rlfn_mogai_1/rlfb_1_2/activation_3_3/Gelu/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1_2/conv2d_14_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1_2/conv2d_14_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/rlfn_mogai_1/rlfb_1_2/activation_3_5/Gelu/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/feed_forward_1/Gelu/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/feed_forward_1/Gelu/add/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/rlfn_mogai_1/feed_forward_1/Gelu/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/feed_forward_1/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/conv2d_7_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/conv2d_7_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/conv2d_8_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/conv2d_8_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_5/Gelu/mul/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_5/Gelu/add/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_3/Gelu/mul/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_3/Gelu/add/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_1/Gelu/mul/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_1/Gelu/add/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/conv2d_1_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/conv2d_1_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_1/Gelu/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/conv2d_2_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/conv2d_2_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_3/Gelu/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/conv2d_3_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/conv2d_3_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_5/Gelu/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/conv2d_4_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/conv2d_4_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/conv2d_5_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/conv2d_5_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/conv2d_6_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/conv2d_6_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/conv2d_9_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/conv2d_9_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/feed_forward_1/conv2d_10_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "254"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/feed_forward_1/depthwise_conv2d_1/depthwise/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "254"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/feed_forward_1/conv2d_11_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "127"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1_2/conv2d_15_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1_2/conv2d_15_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1_2/esa_1_1/conv2d_16_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1_2/esa_1_1/conv2d_16_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1_2/esa_1_1/conv2d_17_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1_2/esa_1_1/conv2d_17_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1_2/esa_1_1/conv2d_20_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1_2/esa_1_1/conv2d_20_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/feed_forward_1_2/conv2d_21_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "254"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/feed_forward_1_2/depthwise_conv2d_1_1/depthwise/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "254"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/feed_forward_1_2/conv2d_22_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "127"}, {"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_2_1/conv2d_26_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_2_1/conv2d_26_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_2_1/esa_2_1/conv2d_27_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_2_1/esa_2_1/conv2d_27_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_2_1/esa_2_1/conv2d_28_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_2_1/esa_2_1/conv2d_28_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_2_1/esa_2_1/conv2d_31_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_2_1/esa_2_1/conv2d_31_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/conv2d_32_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/conv2d_32_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/conv2d_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/conv2d_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/sequential_1/conv2d_33_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/sequential_1/conv2d_33_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "args_0", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "240"}, {"size": "320"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/conv2d_1/BiasAdd", "op": "_FusedConv2D", "input": ["args_0", "StatefulPartitionedCall/rlfn_mogai_1/conv2d_1/convolution/ReadVariableOp", "StatefulPartitionedCall/rlfn_mogai_1/conv2d_1/Squeeze"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "explicit_paddings": {"list": {}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "-5"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "48"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "num_host_args": {"i": "0"}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.2}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/conv2d_1_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/rlfn_mogai_1/conv2d_1/BiasAdd", "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/conv2d_1_1/convolution/ReadVariableOp", "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/conv2d_1_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "48"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}]}}, "num_host_args": {"i": "0"}, "leakyrelu_alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_1/Gelu/mul", "op": "Mul", "input": ["StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_1/Gelu/mul/x", "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/conv2d_1_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_1/Gelu/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/conv2d_1_1/BiasAdd", "ConstantFolding/StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_1/Gelu/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_1/Gelu/Erf", "op": "Erf", "input": ["StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_1/Gelu/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_1/Gelu/add", "op": "AddV2", "input": ["StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_1/Gelu/add/x", "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_1/Gelu/Erf"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_1/Gelu/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_1/Gelu/mul", "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_1/Gelu/add"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/conv2d_2_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_1/Gelu/mul_1", "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/conv2d_2_1/convolution/ReadVariableOp", "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/conv2d_2_1/Squeeze"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "use_cudnn_on_gpu": {"b": true}, "num_host_args": {"i": "0"}, "leakyrelu_alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "48"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}]}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_3/Gelu/mul", "op": "Mul", "input": ["StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_3/Gelu/mul/x", "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/conv2d_2_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_3/Gelu/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/conv2d_2_1/BiasAdd", "ConstantFolding/StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_3/Gelu/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_3/Gelu/Erf", "op": "Erf", "input": ["StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_3/Gelu/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_3/Gelu/add", "op": "AddV2", "input": ["StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_3/Gelu/add/x", "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_3/Gelu/Erf"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_3/Gelu/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_3/Gelu/mul", "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_3/Gelu/add"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/conv2d_3_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_3/Gelu/mul_1", "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/conv2d_3_1/convolution/ReadVariableOp", "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/conv2d_3_1/Squeeze"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "48"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}]}}, "num_host_args": {"i": "0"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_5/Gelu/mul", "op": "Mul", "input": ["StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_5/Gelu/mul/x", "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/conv2d_3_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_5/Gelu/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/conv2d_3_1/BiasAdd", "ConstantFolding/StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_5/Gelu/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_5/Gelu/Erf", "op": "Erf", "input": ["StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_5/Gelu/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_5/Gelu/add", "op": "AddV2", "input": ["StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_5/Gelu/add/x", "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_5/Gelu/Erf"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_5/Gelu/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_5/Gelu/mul", "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_5/Gelu/add"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/activation_1_5/Gelu/mul_1", "StatefulPartitionedCall/rlfn_mogai_1/conv2d_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/conv2d_4_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/add", "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/conv2d_4_1/convolution/ReadVariableOp", "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/conv2d_4_1/Squeeze"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "48"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "48"}]}]}}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "num_host_args": {"i": "0"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/conv2d_4_1/BiasAdd"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/Shape_1", "op": "Shape", "input": ["StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/conv2d_4_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/conv2d_5_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/conv2d_4_1/BiasAdd", "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/conv2d_5_1/convolution/ReadVariableOp", "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/conv2d_5_1/Squeeze"], "device": "/device:CPU:0", "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "48"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "16"}]}]}}, "explicit_paddings": {"list": {}}, "num_host_args": {"i": "0"}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}, "leakyrelu_alpha": {"f": 0.2}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/Shape", "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/strided_slice/stack", "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/strided_slice/stack_1", "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/Shape_1", "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/strided_slice_1/stack", "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/strided_slice_1/stack_1", "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/strided_slice_1/stack_2"], "attr": {"begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/conv2d_7_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/conv2d_5_1/BiasAdd", "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/conv2d_7_1/convolution/ReadVariableOp", "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/conv2d_7_1/Squeeze"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "leakyrelu_alpha": {"f": 0.2}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-6"}, {"size": "-7"}, {"size": "16"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "num_host_args": {"i": "0"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/conv2d_6_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/conv2d_5_1/BiasAdd", "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/conv2d_6_1/convolution/ReadVariableOp", "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/conv2d_6_1/Squeeze"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-6"}, {"size": "-7"}, {"size": "16"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "16"}]}]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "num_host_args": {"i": "0"}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/resize/size", "op": "Pack", "input": ["StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/strided_slice", "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/strided_slice_1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/conv2d_7_1/BiasAdd"], "attr": {"strides": {"list": {"i": ["1", "3", "3", "1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "7", "7", "1"]}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/conv2d_8_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/MaxPool2d", "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/conv2d_8_1/convolution/ReadVariableOp", "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/conv2d_8_1/Squeeze"], "device": "/device:CPU:0", "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-10"}, {"size": "-11"}, {"size": "16"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}]}}, "num_args": {"i": "1"}, "filter_format": {"s": "SFdJTw=="}, "num_host_args": {"i": "0"}, "leakyrelu_alpha": {"f": 0.2}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/resize/ResizeBilinear", "op": "ResizeBilinear", "input": ["StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/conv2d_8_1/BiasAdd", "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/resize/size"], "attr": {"half_pixel_centers": {"b": true}, "T": {"type": "DT_FLOAT"}, "align_corners": {"b": false}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/resize/ResizeBilinear", "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/conv2d_6_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/conv2d_9_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/add", "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/conv2d_9_1/convolution/ReadVariableOp", "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/conv2d_9_1/Squeeze"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-16"}, {"size": "-17"}, {"size": "16"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "48"}]}]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_host_args": {"i": "0"}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "leakyrelu_alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/activation_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/conv2d_9_1/BiasAdd"], "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-18"}, {"size": "-19"}, {"size": "48"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/conv2d_4_1/BiasAdd", "StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/activation_1/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/feed_forward_1/conv2d_10_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/rlfn_mogai_1/rlfb_1/esa_1/mul", "StatefulPartitionedCall/rlfn_mogai_1/feed_forward_1/conv2d_10_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-20"}, {"size": "-21"}, {"size": "48"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "254"}]}]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/feed_forward_1/depthwise_conv2d_1/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/rlfn_mogai_1/feed_forward_1/conv2d_10_1/convolution", "StatefulPartitionedCall/rlfn_mogai_1/feed_forward_1/depthwise_conv2d_1/depthwise/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-22"}, {"size": "-23"}, {"size": "254"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "254"}, {"size": "1"}]}]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1/feed_forward_1/split", "op": "Split", "input": 