{"format": "graph-model", "generatedBy": "2.17.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"args_0": {"name": "args_0:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "360"}, {"size": "640"}, {"size": "3"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1440"}, {"size": "2560"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/span30_2_1/spab1_16_1/conv3xc_54_1/conv2d_58_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}}}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_16_1/conv3xc_55_1/conv2d_59_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}}}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_16_1/sub/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_17_1/conv3xc_56_1/conv2d_60_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}}}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_17_1/conv3xc_57_1/conv2d_61_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}}}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_17_1/conv3xc_58_1/conv2d_62_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}}}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_17_1/sub/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/span30_2_1/conv3xc_59_1/conv2d_64_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}}}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/conv3xc_40_1/conv2d_44_1/convolution/ArithmeticOptimizer/FoldMultiplyIntoConv_scaled_StatefulPartitionedCall/span30_2_1/conv3xc_40_1/conv2d_44_1/convolution_ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "28"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_12_1/conv3xc_41_1/conv2d_45_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}}}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_12_1/conv3xc_42_1/conv2d_46_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_12_1/conv3xc_43_1/conv2d_47_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}}}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_12_1/sub/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_13_1/conv3xc_44_1/conv2d_48_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}}}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_13_1/conv3xc_45_1/conv2d_49_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}}}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_13_1/conv3xc_46_1/conv2d_50_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_13_1/sub/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_14_1/conv3xc_47_1/conv2d_51_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_14_1/conv3xc_48_1/conv2d_52_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}}}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_14_1/conv3xc_49_1/conv2d_53_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}}}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_14_1/sub/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_15_1/conv3xc_50_1/conv2d_54_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}}}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_15_1/conv3xc_51_1/conv2d_55_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}}}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_15_1/conv3xc_52_1/conv2d_56_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}}}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_15_1/sub/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_16_1/conv3xc_53_1/conv2d_57_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/span30_2_1/conv_layer_4_1/conv2d_63_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "112"}, {"size": "28"}]}}}}}, {"name": "StatefulPartitionedCall/span30_2_1/conv_layer_4_1/conv2d_63_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "28"}]}}}}}, {"name": "StatefulPartitionedCall/span30_2_1/pixel_shuffle_block_2_1/conv_layer_5_1/conv2d_65_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/pixel_shuffle_block_2_1/conv_layer_5_1/conv2d_65_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "args_0", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "360"}, {"size": "640"}, {"size": "3"}]}}}}, {"name": "StatefulPartitionedCall/span30_2_1/sub", "op": "Sub", "input": ["args_0", "unknown"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/conv3xc_40_1/conv2d_44_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/span30_2_1/sub", "StatefulPartitionedCall/span30_2_1/conv3xc_40_1/conv2d_44_1/convolution/ArithmeticOptimizer/FoldMultiplyIntoConv_scaled_StatefulPartitionedCall/span30_2_1/conv3xc_40_1/conv2d_44_1/convolution_ReadVariableOp"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "-5"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "28"}]}]}}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_12_1/conv3xc_41_1/conv2d_45_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/span30_2_1/conv3xc_40_1/conv2d_44_1/convolution", "StatefulPartitionedCall/span30_2_1/spab1_12_1/conv3xc_41_1/conv2d_45_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}]}}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_12_1/activation_12_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/span30_2_1/spab1_12_1/conv3xc_41_1/conv2d_45_1/convolution"], "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_12_1/activation_12_1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/span30_2_1/spab1_12_1/conv3xc_41_1/conv2d_45_1/convolution", "StatefulPartitionedCall/span30_2_1/spab1_12_1/activation_12_1/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_12_1/conv3xc_42_1/conv2d_46_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/span30_2_1/spab1_12_1/activation_12_1/mul_1", "StatefulPartitionedCall/span30_2_1/spab1_12_1/conv3xc_42_1/conv2d_46_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}]}}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_12_1/activation_12_3/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/span30_2_1/spab1_12_1/conv3xc_42_1/conv2d_46_1/convolution"], "attr": {"T": {"type": "DT_FLOAT"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}]}}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_12_1/activation_12_3/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/span30_2_1/spab1_12_1/conv3xc_42_1/conv2d_46_1/convolution", "StatefulPartitionedCall/span30_2_1/spab1_12_1/activation_12_3/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_12_1/conv3xc_43_1/conv2d_47_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/span30_2_1/spab1_12_1/activation_12_3/mul_1", "StatefulPartitionedCall/span30_2_1/spab1_12_1/conv3xc_43_1/conv2d_47_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_12_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/span30_2_1/spab1_12_1/conv3xc_43_1/conv2d_47_1/convolution"], "attr": {"T": {"type": "DT_FLOAT"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}]}}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_12_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/span30_2_1/spab1_12_1/conv3xc_43_1/conv2d_47_1/convolution", "StatefulPartitionedCall/span30_2_1/conv3xc_40_1/conv2d_44_1/convolution"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_12_1/sub", "op": "Sub", "input": ["StatefulPartitionedCall/span30_2_1/spab1_12_1/Sigmoid", "StatefulPartitionedCall/span30_2_1/spab1_12_1/sub/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_12_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/span30_2_1/spab1_12_1/add", "StatefulPartitionedCall/span30_2_1/spab1_12_1/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_13_1/conv3xc_44_1/conv2d_48_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/span30_2_1/spab1_12_1/mul", "StatefulPartitionedCall/span30_2_1/spab1_13_1/conv3xc_44_1/conv2d_48_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_13_1/activation_13_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/span30_2_1/spab1_13_1/conv3xc_44_1/conv2d_48_1/convolution"], "attr": {"T": {"type": "DT_FLOAT"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}]}}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_13_1/activation_13_1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/span30_2_1/spab1_13_1/conv3xc_44_1/conv2d_48_1/convolution", "StatefulPartitionedCall/span30_2_1/spab1_13_1/activation_13_1/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_13_1/conv3xc_45_1/conv2d_49_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/span30_2_1/spab1_13_1/activation_13_1/mul_1", "StatefulPartitionedCall/span30_2_1/spab1_13_1/conv3xc_45_1/conv2d_49_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}]}}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_13_1/activation_13_3/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/span30_2_1/spab1_13_1/conv3xc_45_1/conv2d_49_1/convolution"], "attr": {"T": {"type": "DT_FLOAT"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}]}}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_13_1/activation_13_3/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/span30_2_1/spab1_13_1/conv3xc_45_1/conv2d_49_1/convolution", "StatefulPartitionedCall/span30_2_1/spab1_13_1/activation_13_3/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_13_1/conv3xc_46_1/conv2d_50_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/span30_2_1/spab1_13_1/activation_13_3/mul_1", "StatefulPartitionedCall/span30_2_1/spab1_13_1/conv3xc_46_1/conv2d_50_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_13_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/span30_2_1/spab1_13_1/conv3xc_46_1/conv2d_50_1/convolution"], "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_13_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/span30_2_1/spab1_13_1/conv3xc_46_1/conv2d_50_1/convolution", "StatefulPartitionedCall/span30_2_1/spab1_12_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_13_1/sub", "op": "Sub", "input": ["StatefulPartitionedCall/span30_2_1/spab1_13_1/Sigmoid", "StatefulPartitionedCall/span30_2_1/spab1_13_1/sub/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_13_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/span30_2_1/spab1_13_1/add", "StatefulPartitionedCall/span30_2_1/spab1_13_1/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_14_1/conv3xc_47_1/conv2d_51_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/span30_2_1/spab1_13_1/mul", "StatefulPartitionedCall/span30_2_1/spab1_14_1/conv3xc_47_1/conv2d_51_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_14_1/activation_14_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/span30_2_1/spab1_14_1/conv3xc_47_1/conv2d_51_1/convolution"], "attr": {"T": {"type": "DT_FLOAT"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}]}}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_14_1/activation_14_1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/span30_2_1/spab1_14_1/conv3xc_47_1/conv2d_51_1/convolution", "StatefulPartitionedCall/span30_2_1/spab1_14_1/activation_14_1/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_14_1/conv3xc_48_1/conv2d_52_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/span30_2_1/spab1_14_1/activation_14_1/mul_1", "StatefulPartitionedCall/span30_2_1/spab1_14_1/conv3xc_48_1/conv2d_52_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}]}}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_14_1/activation_14_3/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/span30_2_1/spab1_14_1/conv3xc_48_1/conv2d_52_1/convolution"], "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_14_1/activation_14_3/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/span30_2_1/spab1_14_1/conv3xc_48_1/conv2d_52_1/convolution", "StatefulPartitionedCall/span30_2_1/spab1_14_1/activation_14_3/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_14_1/conv3xc_49_1/conv2d_53_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/span30_2_1/spab1_14_1/activation_14_3/mul_1", "StatefulPartitionedCall/span30_2_1/spab1_14_1/conv3xc_49_1/conv2d_53_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_14_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/span30_2_1/spab1_14_1/conv3xc_49_1/conv2d_53_1/convolution"], "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_14_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/span30_2_1/spab1_14_1/conv3xc_49_1/conv2d_53_1/convolution", "StatefulPartitionedCall/span30_2_1/spab1_13_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_14_1/sub", "op": "Sub", "input": ["StatefulPartitionedCall/span30_2_1/spab1_14_1/Sigmoid", "StatefulPartitionedCall/span30_2_1/spab1_14_1/sub/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_14_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/span30_2_1/spab1_14_1/add", "StatefulPartitionedCall/span30_2_1/spab1_14_1/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_15_1/conv3xc_50_1/conv2d_54_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/span30_2_1/spab1_14_1/mul", "StatefulPartitionedCall/span30_2_1/spab1_15_1/conv3xc_50_1/conv2d_54_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}]}}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_15_1/activation_15_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/span30_2_1/spab1_15_1/conv3xc_50_1/conv2d_54_1/convolution"], "attr": {"T": {"type": "DT_FLOAT"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}]}}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_15_1/activation_15_1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/span30_2_1/spab1_15_1/conv3xc_50_1/conv2d_54_1/convolution", "StatefulPartitionedCall/span30_2_1/spab1_15_1/activation_15_1/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_15_1/conv3xc_51_1/conv2d_55_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/span30_2_1/spab1_15_1/activation_15_1/mul_1", "StatefulPartitionedCall/span30_2_1/spab1_15_1/conv3xc_51_1/conv2d_55_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_15_1/activation_15_3/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/span30_2_1/spab1_15_1/conv3xc_51_1/conv2d_55_1/convolution"], "attr": {"T": {"type": "DT_FLOAT"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}]}}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_15_1/activation_15_3/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/span30_2_1/spab1_15_1/conv3xc_51_1/conv2d_55_1/convolution", "StatefulPartitionedCall/span30_2_1/spab1_15_1/activation_15_3/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_15_1/conv3xc_52_1/conv2d_56_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/span30_2_1/spab1_15_1/activation_15_3/mul_1", "StatefulPartitionedCall/span30_2_1/spab1_15_1/conv3xc_52_1/conv2d_56_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}]}}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_15_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/span30_2_1/spab1_15_1/conv3xc_52_1/conv2d_56_1/convolution"], "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_15_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/span30_2_1/spab1_15_1/conv3xc_52_1/conv2d_56_1/convolution", "StatefulPartitionedCall/span30_2_1/spab1_14_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_15_1/sub", "op": "Sub", "input": ["StatefulPartitionedCall/span30_2_1/spab1_15_1/Sigmoid", "StatefulPartitionedCall/span30_2_1/spab1_15_1/sub/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_15_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/span30_2_1/spab1_15_1/add", "StatefulPartitionedCall/span30_2_1/spab1_15_1/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_16_1/conv3xc_53_1/conv2d_57_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/span30_2_1/spab1_15_1/mul", "StatefulPartitionedCall/span30_2_1/spab1_16_1/conv3xc_53_1/conv2d_57_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_16_1/activation_16_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/span30_2_1/spab1_16_1/conv3xc_53_1/conv2d_57_1/convolution"], "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_16_1/activation_16_1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/span30_2_1/spab1_16_1/conv3xc_53_1/conv2d_57_1/convolution", "StatefulPartitionedCall/span30_2_1/spab1_16_1/activation_16_1/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_16_1/conv3xc_54_1/conv2d_58_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/span30_2_1/spab1_16_1/activation_16_1/mul_1", "StatefulPartitionedCall/span30_2_1/spab1_16_1/conv3xc_54_1/conv2d_58_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}]}}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_16_1/activation_16_3/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/span30_2_1/spab1_16_1/conv3xc_54_1/conv2d_58_1/convolution"], "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_16_1/activation_16_3/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/span30_2_1/spab1_16_1/conv3xc_54_1/conv2d_58_1/convolution", "StatefulPartitionedCall/span30_2_1/spab1_16_1/activation_16_3/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_16_1/conv3xc_55_1/conv2d_59_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/span30_2_1/spab1_16_1/activation_16_3/mul_1", "StatefulPartitionedCall/span30_2_1/spab1_16_1/conv3xc_55_1/conv2d_59_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}]}}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_16_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/span30_2_1/spab1_16_1/conv3xc_55_1/conv2d_59_1/convolution"], "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_16_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/span30_2_1/spab1_16_1/conv3xc_55_1/conv2d_59_1/convolution", "StatefulPartitionedCall/span30_2_1/spab1_15_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_16_1/sub", "op": "Sub", "input": ["StatefulPartitionedCall/span30_2_1/spab1_16_1/Sigmoid", "StatefulPartitionedCall/span30_2_1/spab1_16_1/sub/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_16_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/span30_2_1/spab1_16_1/add", "StatefulPartitionedCall/span30_2_1/spab1_16_1/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_17_1/conv3xc_56_1/conv2d_60_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/span30_2_1/spab1_16_1/mul", "StatefulPartitionedCall/span30_2_1/spab1_17_1/conv3xc_56_1/conv2d_60_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_17_1/activation_17_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/span30_2_1/spab1_17_1/conv3xc_56_1/conv2d_60_1/convolution"], "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_17_1/activation_17_1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/span30_2_1/spab1_17_1/conv3xc_56_1/conv2d_60_1/convolution", "StatefulPartitionedCall/span30_2_1/spab1_17_1/activation_17_1/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_17_1/conv3xc_57_1/conv2d_61_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/span30_2_1/spab1_17_1/activation_17_1/mul_1", "StatefulPartitionedCall/span30_2_1/spab1_17_1/conv3xc_57_1/conv2d_61_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}]}}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_17_1/activation_17_3/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/span30_2_1/spab1_17_1/conv3xc_57_1/conv2d_61_1/convolution"], "attr": {"T": {"type": "DT_FLOAT"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}]}}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_17_1/activation_17_3/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/span30_2_1/spab1_17_1/conv3xc_57_1/conv2d_61_1/convolution", "StatefulPartitionedCall/span30_2_1/spab1_17_1/activation_17_3/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_17_1/conv3xc_58_1/conv2d_62_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/span30_2_1/spab1_17_1/activation_17_3/mul_1", "StatefulPartitionedCall/span30_2_1/spab1_17_1/conv3xc_58_1/conv2d_62_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}]}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_17_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/span30_2_1/spab1_17_1/conv3xc_58_1/conv2d_62_1/convolution"], "attr": {"T": {"type": "DT_FLOAT"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}]}}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_17_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/span30_2_1/spab1_17_1/conv3xc_58_1/conv2d_62_1/convolution", "StatefulPartitionedCall/span30_2_1/spab1_16_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_17_1/sub", "op": "Sub", "input": ["StatefulPartitionedCall/span30_2_1/spab1_17_1/Sigmoid", "StatefulPartitionedCall/span30_2_1/spab1_17_1/sub/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_17_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/span30_2_1/spab1_17_1/add", "StatefulPartitionedCall/span30_2_1/spab1_17_1/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_2_1/conv3xc_59_1/conv2d_64_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/span30_2_1/spab1_17_1/mul", "StatefulPartitionedCall/span30_2_1/conv3xc_59_1/conv2d_64_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/span30_2_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/span30_2_1/conv3xc_40_1/conv2d_44_1/convolution", "StatefulPartitionedCall/span30_2_1/conv3xc_59_1/conv2d_64_1/convolution", "StatefulPartitionedCall/span30_2_1/spab1_12_1/mul", "StatefulPartitionedCall/span30_2_1/spab1_16_1/conv3xc_53_1/conv2d_57_1/convolution", "StatefulPartitionedCall/span30_2_1/concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/span30_2_1/conv_layer_4_1/conv2d_63_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/span30_2_1/concat", "StatefulPartitionedCall/span30_2_1/conv_layer_4_1/conv2d_63_1/convolution/ReadVariableOp", "StatefulPartitionedCall/span30_2_1/conv_layer_4_1/conv2d_63_1/Squeeze"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "num_host_args": {"i": "0"}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "112"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "112"}, {"size": "28"}]}]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "filter_format": {"s": "SFdJTw=="}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/span30_2_1/pixel_shuffle_block_2_1/conv_layer_5_1/conv2d_65_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/span30_2_1/conv_layer_4_1/conv2d_63_1/BiasAdd", "StatefulPartitionedCall/span30_2_1/pixel_shuffle_block_2_1/conv_layer_5_1/conv2d_65_1/convolution/ReadVariableOp", "StatefulPartitionedCall/span30_2_1/pixel_shuffle_block_2_1/conv_layer_5_1/conv2d_65_1/Squeeze"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "filter_format": {"s": "SFdJTw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "48"}]}]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "num_host_args": {"i": "0"}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/span30_2_1/pixel_shuffle_block_2_1/DepthToSpace", "op": "DepthToSpace", "input": ["StatefulPartitionedCall/span30_2_1/pixel_shuffle_block_2_1/conv_layer_5_1/conv2d_65_1/BiasAdd"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "block_size": {"i": "4"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/span30_2_1/pixel_shuffle_block_2_1/DepthToSpace"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1994}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/span30_2_1/spab1_16_1/conv3xc_54_1/conv2d_58_1/convolution/ReadVariableOp", "shape": [3, 3, 28, 28], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_16_1/conv3xc_55_1/conv2d_59_1/convolution/ReadVariableOp", "shape": [3, 3, 28, 28], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_16_1/sub/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_17_1/conv3xc_56_1/conv2d_60_1/convolution/ReadVariableOp", "shape": [3, 3, 28, 28], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_17_1/conv3xc_57_1/conv2d_61_1/convolution/ReadVariableOp", "shape": [3, 3, 28, 28], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_17_1/conv3xc_58_1/conv2d_62_1/convolution/ReadVariableOp", "shape": [3, 3, 28, 28], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_17_1/sub/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_2_1/conv3xc_59_1/conv2d_64_1/convolution/ReadVariableOp", "shape": [3, 3, 28, 28], "dtype": "float32"}, {"name": "unknown", "shape": [1, 1, 1, 3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_2_1/conv3xc_40_1/conv2d_44_1/convolution/ArithmeticOptimizer/FoldMultiplyIntoConv_scaled_StatefulPartitionedCall/span30_2_1/conv3xc_40_1/conv2d_44_1/convolution_ReadVariableOp", "shape": [3, 3, 3, 28], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_12_1/conv3xc_41_1/conv2d_45_1/convolution/ReadVariableOp", "shape": [3, 3, 28, 28], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_12_1/conv3xc_42_1/conv2d_46_1/convolution/ReadVariableOp", "shape": [3, 3, 28, 28], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_12_1/conv3xc_43_1/conv2d_47_1/convolution/ReadVariableOp", "shape": [3, 3, 28, 28], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_12_1/sub/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_13_1/conv3xc_44_1/conv2d_48_1/convolution/ReadVariableOp", "shape": [3, 3, 28, 28], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_13_1/conv3xc_45_1/conv2d_49_1/convolution/ReadVariableOp", "shape": [3, 3, 28, 28], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_13_1/conv3xc_46_1/conv2d_50_1/convolution/ReadVariableOp", "shape": [3, 3, 28, 28], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_13_1/sub/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_14_1/conv3xc_47_1/conv2d_51_1/convolution/ReadVariableOp", "shape": [3, 3, 28, 28], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_14_1/conv3xc_48_1/conv2d_52_1/convolution/ReadVariableOp", "shape": [3, 3, 28, 28], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_14_1/conv3xc_49_1/conv2d_53_1/convolution/ReadVariableOp", "shape": [3, 3, 28, 28], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_14_1/sub/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_15_1/conv3xc_50_1/conv2d_54_1/convolution/ReadVariableOp", "shape": [3, 3, 28, 28], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_15_1/conv3xc_51_1/conv2d_55_1/convolution/ReadVariableOp", "shape": [3, 3, 28, 28], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_15_1/conv3xc_52_1/conv2d_56_1/convolution/ReadVariableOp", "shape": [3, 3, 28, 28], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_15_1/sub/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_2_1/spab1_16_1/conv3xc_53_1/conv2d_57_1/convolution/ReadVariableOp", "shape": [3, 3, 28, 28], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_2_1/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/span30_2_1/conv_layer_4_1/conv2d_63_1/convolution/ReadVariableOp", "shape": [1, 1, 112, 28], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_2_1/conv_layer_4_1/conv2d_63_1/Squeeze", "shape": [28], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_2_1/pixel_shuffle_block_2_1/conv_layer_5_1/conv2d_65_1/convolution/ReadVariableOp", "shape": [3, 3, 28, 48], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_2_1/pixel_shuffle_block_2_1/conv_layer_5_1/conv2d_65_1/Squeeze", "shape": [48], "dtype": "float32"}]}]}