{"format": "graph-model", "generatedBy": "2.17.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"args_0": {"name": "args_0:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "240"}, {"size": "320"}, {"size": "3"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "720"}, {"size": "960"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "PartitionedCall/bilinear_super_resolution_1/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/bilinear_super_resolution_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/bilinear_super_resolution_1/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/bilinear_super_resolution_1/mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "PartitionedCall/bilinear_super_resolution_1/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/bilinear_super_resolution_1/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/bilinear_super_resolution_1/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/bilinear_super_resolution_1/mul_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "args_0", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "240"}, {"size": "320"}, {"size": "3"}]}}}}, {"name": "PartitionedCall/bilinear_super_resolution_1/Shape", "op": "Shape", "input": ["args_0"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "PartitionedCall/bilinear_super_resolution_1/strided_slice", "op": "StridedSlice", "input": ["PartitionedCall/bilinear_super_resolution_1/Shape", "PartitionedCall/bilinear_super_resolution_1/strided_slice/stack", "PartitionedCall/bilinear_super_resolution_1/strided_slice/stack_1", "PartitionedCall/bilinear_super_resolution_1/strided_slice/stack_2"], "attr": {"end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/bilinear_super_resolution_1/strided_slice_1", "op": "StridedSlice", "input": ["PartitionedCall/bilinear_super_resolution_1/Shape", "PartitionedCall/bilinear_super_resolution_1/strided_slice_1/stack", "PartitionedCall/bilinear_super_resolution_1/strided_slice_1/stack_1", "PartitionedCall/bilinear_super_resolution_1/strided_slice_1/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}}}, {"name": "PartitionedCall/bilinear_super_resolution_1/mul", "op": "Mul", "input": ["PartitionedCall/bilinear_super_resolution_1/strided_slice", "PartitionedCall/bilinear_super_resolution_1/mul/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/bilinear_super_resolution_1/mul_1", "op": "Mul", "input": ["PartitionedCall/bilinear_super_resolution_1/strided_slice_1", "PartitionedCall/bilinear_super_resolution_1/mul_1/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/bilinear_super_resolution_1/resize/size", "op": "Pack", "input": ["PartitionedCall/bilinear_super_resolution_1/mul", "PartitionedCall/bilinear_super_resolution_1/mul_1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "PartitionedCall/bilinear_super_resolution_1/resize/ResizeBilinear", "op": "ResizeBilinear", "input": ["args_0", "PartitionedCall/bilinear_super_resolution_1/resize/size"], "attr": {"T": {"type": "DT_FLOAT"}, "align_corners": {"b": false}, "half_pixel_centers": {"b": true}}}, {"name": "Identity", "op": "Identity", "input": ["PartitionedCall/bilinear_super_resolution_1/resize/ResizeBilinear"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1994}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "PartitionedCall/bilinear_super_resolution_1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/bilinear_super_resolution_1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/bilinear_super_resolution_1/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/bilinear_super_resolution_1/mul/y", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/bilinear_super_resolution_1/strided_slice_1/stack", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/bilinear_super_resolution_1/strided_slice_1/stack_1", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/bilinear_super_resolution_1/strided_slice_1/stack_2", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/bilinear_super_resolution_1/mul_1/y", "shape": [], "dtype": "int32"}]}]}