{"format": "graph-model", "generatedBy": "2.17.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"args_0": {"name": "args_0:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "360"}, {"size": "640"}, {"size": "3"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1440"}, {"size": "2560"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_5_1/esa_5_1/conv2d_63_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_5_1/esa_5_1/conv2d_63_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_5_1/esa_5_1/conv2d_64_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_5_1/esa_5_1/conv2d_64_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_5_1/esa_5_1/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_5_1/esa_5_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_5_1/esa_5_1/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_5_1/esa_5_1/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_5_1/esa_5_1/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_5_1/esa_5_1/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_5_1/activation_11_5/Gelu/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_5_1/activation_11_5/Gelu/add/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_5_1/activation_11_3/Gelu/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_5_1/activation_11_3/Gelu/add/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_5_1/activation_11_1/Gelu/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_5_1/activation_11_1/Gelu/add/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_5_1/conv2d_57_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_5_1/conv2d_57_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_5_1/activation_11_1/Gelu/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_5_1/conv2d_58_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_5_1/conv2d_58_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_5_1/activation_11_3/Gelu/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_5_1/conv2d_59_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_5_1/conv2d_59_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_5_1/activation_11_5/Gelu/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/feed_forward_3_1/Gelu/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/feed_forward_3_1/Gelu/add/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/rlfn_mogai_1_1/feed_forward_3_1/Gelu/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/feed_forward_3_1/split/split_dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_4_1/esa_4_1/conv2d_52_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_4_1/esa_4_1/conv2d_52_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_4_1/esa_4_1/conv2d_53_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_4_1/esa_4_1/conv2d_53_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_4_1/esa_4_1/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_4_1/esa_4_1/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_4_1/esa_4_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_4_1/esa_4_1/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_4_1/esa_4_1/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_4_1/esa_4_1/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_4_1/activation_9_5/Gelu/mul/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_4_1/activation_9_5/Gelu/add/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_4_1/activation_9_3/Gelu/mul/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_4_1/activation_9_3/Gelu/add/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_4_1/activation_9_1/Gelu/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_4_1/activation_9_1/Gelu/add/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_4_1/conv2d_46_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_4_1/conv2d_46_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_4_1/activation_9_1/Gelu/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_4_1/conv2d_47_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_4_1/conv2d_47_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_4_1/activation_9_3/Gelu/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_4_1/conv2d_48_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_4_1/conv2d_48_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_4_1/activation_9_5/Gelu/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/feed_forward_2_1/Gelu/mul/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/feed_forward_2_1/Gelu/add/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/rlfn_mogai_1_1/feed_forward_2_1/Gelu/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/feed_forward_2_1/split/split_dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/conv2d_41_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/conv2d_41_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/conv2d_42_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/conv2d_42_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_5/Gelu/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_5/Gelu/add/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_3/Gelu/mul/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_3/Gelu/add/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_1/Gelu/mul/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_1/Gelu/add/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/conv2d_35_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/conv2d_35_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_1/Gelu/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/conv2d_36_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/conv2d_36_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_3/Gelu/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/conv2d_37_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/conv2d_37_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_5/Gelu/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/conv2d_38_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/conv2d_38_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/conv2d_39_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/conv2d_39_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/conv2d_40_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/conv2d_40_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/conv2d_43_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/conv2d_43_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/feed_forward_2_1/conv2d_44_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "254"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/feed_forward_2_1/depthwise_conv2d_2_1/depthwise/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "254"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/feed_forward_2_1/conv2d_45_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "127"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_4_1/conv2d_49_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_4_1/conv2d_49_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_4_1/esa_4_1/conv2d_50_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_4_1/esa_4_1/conv2d_50_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_4_1/esa_4_1/conv2d_51_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_4_1/esa_4_1/conv2d_51_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_4_1/esa_4_1/conv2d_54_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_4_1/esa_4_1/conv2d_54_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/feed_forward_3_1/conv2d_55_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "254"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/feed_forward_3_1/depthwise_conv2d_3_1/depthwise/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "254"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/feed_forward_3_1/conv2d_56_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "127"}, {"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_5_1/conv2d_60_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_5_1/conv2d_60_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_5_1/esa_5_1/conv2d_61_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_5_1/esa_5_1/conv2d_61_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_5_1/esa_5_1/conv2d_62_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_5_1/esa_5_1/conv2d_62_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_5_1/esa_5_1/conv2d_65_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_5_1/esa_5_1/conv2d_65_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/conv2d_66_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/conv2d_66_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/conv2d_34_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/conv2d_34_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/sequential_1_1/conv2d_67_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/sequential_1_1/conv2d_67_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "args_0", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "360"}, {"size": "640"}, {"size": "3"}]}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/conv2d_34_1/BiasAdd", "op": "_FusedConv2D", "input": ["args_0", "StatefulPartitionedCall/rlfn_mogai_1_1/conv2d_34_1/convolution/ReadVariableOp", "StatefulPartitionedCall/rlfn_mogai_1_1/conv2d_34_1/Squeeze"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "num_host_args": {"i": "0"}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "-5"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "48"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "leakyrelu_alpha": {"f": 0.2}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/conv2d_35_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/rlfn_mogai_1_1/conv2d_34_1/BiasAdd", "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/conv2d_35_1/convolution/ReadVariableOp", "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/conv2d_35_1/Squeeze"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "num_host_args": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "filter_format": {"s": "SFdJTw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "leakyrelu_alpha": {"f": 0.2}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "48"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}]}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_1/Gelu/mul", "op": "Mul", "input": ["StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_1/Gelu/mul/x", "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/conv2d_35_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_1/Gelu/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/conv2d_35_1/BiasAdd", "ConstantFolding/StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_1/Gelu/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_1/Gelu/Erf", "op": "Erf", "input": ["StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_1/Gelu/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_1/Gelu/add", "op": "AddV2", "input": ["StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_1/Gelu/add/x", "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_1/Gelu/Erf"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_1/Gelu/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_1/Gelu/mul", "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_1/Gelu/add"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/conv2d_36_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_1/Gelu/mul_1", "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/conv2d_36_1/convolution/ReadVariableOp", "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/conv2d_36_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "48"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}]}}, "num_host_args": {"i": "0"}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "leakyrelu_alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_3/Gelu/mul", "op": "Mul", "input": ["StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_3/Gelu/mul/x", "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/conv2d_36_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_3/Gelu/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/conv2d_36_1/BiasAdd", "ConstantFolding/StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_3/Gelu/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_3/Gelu/Erf", "op": "Erf", "input": ["StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_3/Gelu/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_3/Gelu/add", "op": "AddV2", "input": ["StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_3/Gelu/add/x", "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_3/Gelu/Erf"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_3/Gelu/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_3/Gelu/mul", "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_3/Gelu/add"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/conv2d_37_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_3/Gelu/mul_1", "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/conv2d_37_1/convolution/ReadVariableOp", "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/conv2d_37_1/Squeeze"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "num_host_args": {"i": "0"}, "leakyrelu_alpha": {"f": 0.2}, "data_format": {"s": "TkhXQw=="}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "48"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "48"}]}]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_5/Gelu/mul", "op": "Mul", "input": ["StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_5/Gelu/mul/x", "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/conv2d_37_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_5/Gelu/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/conv2d_37_1/BiasAdd", "ConstantFolding/StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_5/Gelu/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_5/Gelu/Erf", "op": "Erf", "input": ["StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_5/Gelu/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_5/Gelu/add", "op": "AddV2", "input": ["StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_5/Gelu/add/x", "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_5/Gelu/Erf"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_5/Gelu/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_5/Gelu/mul", "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_5/Gelu/add"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/activation_7_5/Gelu/mul_1", "StatefulPartitionedCall/rlfn_mogai_1_1/conv2d_34_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/conv2d_38_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/add", "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/conv2d_38_1/convolution/ReadVariableOp", "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/conv2d_38_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "num_args": {"i": "1"}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "48"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "48"}]}]}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "leakyrelu_alpha": {"f": 0.2}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/conv2d_38_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/Shape_1", "op": "Shape", "input": ["StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/conv2d_38_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/conv2d_39_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/conv2d_38_1/BiasAdd", "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/conv2d_39_1/convolution/ReadVariableOp", "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/conv2d_39_1/Squeeze"], "device": "/device:CPU:0", "attr": {"TArgs": {"list": {"type": ["DT_FLOAT"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "leakyrelu_alpha": {"f": 0.2}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "48"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "16"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "num_host_args": {"i": "0"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/Shape", "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/strided_slice/stack", "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/strided_slice/stack_1", "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/Shape_1", "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/strided_slice_1/stack", "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/strided_slice_1/stack_1", "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/strided_slice_1/stack_2"], "attr": {"end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/conv2d_41_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/conv2d_39_1/BiasAdd", "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/conv2d_41_1/convolution/ReadVariableOp", "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/conv2d_41_1/Squeeze"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "num_host_args": {"i": "0"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "filter_format": {"s": "SFdJTw=="}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-6"}, {"size": "-7"}, {"size": "16"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}]}}, "epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/conv2d_40_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/conv2d_39_1/BiasAdd", "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/conv2d_40_1/convolution/ReadVariableOp", "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/conv2d_40_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-6"}, {"size": "-7"}, {"size": "16"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "16"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/resize/size", "op": "Pack", "input": ["StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/strided_slice", "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/strided_slice_1"], "attr": {"axis": {"i": "0"}, "N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/conv2d_41_1/BiasAdd"], "attr": {"explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "7", "7", "1"]}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "3", "3", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/conv2d_42_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/MaxPool2d", "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/conv2d_42_1/convolution/ReadVariableOp", "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/conv2d_42_1/Squeeze"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-10"}, {"size": "-11"}, {"size": "16"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}]}}, "explicit_paddings": {"list": {}}, "num_host_args": {"i": "0"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/resize/ResizeBilinear", "op": "ResizeBilinear", "input": ["StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/conv2d_42_1/BiasAdd", "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/resize/size"], "attr": {"half_pixel_centers": {"b": true}, "T": {"type": "DT_FLOAT"}, "align_corners": {"b": false}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/resize/ResizeBilinear", "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/conv2d_40_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/conv2d_43_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/add", "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/conv2d_43_1/convolution/ReadVariableOp", "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/conv2d_43_1/Squeeze"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "leakyrelu_alpha": {"f": 0.2}, "num_host_args": {"i": "0"}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-16"}, {"size": "-17"}, {"size": "16"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "48"}]}]}}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/activation_6_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/conv2d_43_1/BiasAdd"], "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-18"}, {"size": "-19"}, {"size": "48"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/conv2d_38_1/BiasAdd", "StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/activation_6_1/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/rlfn_mogai_1_1/feed_forward_2_1/conv2d_44_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/rlfn_mogai_1_1/rlfb_3_1/esa_3_1/mul", "StatefulPartitionedCall/rlfn_mogai_1_1/feed_forward_2_1/conv2d_44_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-20"}, {"size": "-21"}, {"size": "48"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "254"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", 