{"format": "graph-model", "generatedBy": "2.17.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"args_0": {"name": "args_0:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "240"}, {"size": "320"}, {"size": "3"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "960"}, {"size": "1280"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/span30_1_1/spab1_10_1/conv3xc_34_1/conv2d_36_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_10_1/conv3xc_35_1/conv2d_37_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}}}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_10_1/sub/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_11_1/conv3xc_36_1/conv2d_38_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}}}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_11_1/conv3xc_37_1/conv2d_39_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_11_1/conv3xc_38_1/conv2d_40_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}}}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_11_1/sub/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/conv3xc_39_1/conv2d_42_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/span30_1_1/conv3xc_20_1/conv2d_22_1/convolution/ArithmeticOptimizer/FoldMultiplyIntoConv_scaled_StatefulPartitionedCall/span30_1_1/conv3xc_20_1/conv2d_22_1/convolution_ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "28"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_6_1/conv3xc_21_1/conv2d_23_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}}}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_6_1/conv3xc_22_1/conv2d_24_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_6_1/conv3xc_23_1/conv2d_25_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_6_1/sub/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_7_1/conv3xc_24_1/conv2d_26_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_7_1/conv3xc_25_1/conv2d_27_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_7_1/conv3xc_26_1/conv2d_28_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_7_1/sub/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_8_1/conv3xc_27_1/conv2d_29_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_8_1/conv3xc_28_1/conv2d_30_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_8_1/conv3xc_29_1/conv2d_31_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}}}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_8_1/sub/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_9_1/conv3xc_30_1/conv2d_32_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_9_1/conv3xc_31_1/conv2d_33_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_9_1/conv3xc_32_1/conv2d_34_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}}}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_9_1/sub/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_10_1/conv3xc_33_1/conv2d_35_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/span30_1_1/conv_layer_2_1/conv2d_41_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "112"}, {"size": "28"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/conv_layer_2_1/conv2d_41_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "28"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/pixel_shuffle_block_1_1/conv_layer_3_1/conv2d_43_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/pixel_shuffle_block_1_1/conv_layer_3_1/conv2d_43_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "args_0", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "240"}, {"size": "320"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/sub", "op": "Sub", "input": ["args_0", "unknown"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/conv3xc_20_1/conv2d_22_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/span30_1_1/sub", "StatefulPartitionedCall/span30_1_1/conv3xc_20_1/conv2d_22_1/convolution/ArithmeticOptimizer/FoldMultiplyIntoConv_scaled_StatefulPartitionedCall/span30_1_1/conv3xc_20_1/conv2d_22_1/convolution_ReadVariableOp"], "device": "/device:CPU:0", "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "-5"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "28"}]}]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_6_1/conv3xc_21_1/conv2d_23_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/span30_1_1/conv3xc_20_1/conv2d_22_1/convolution", "StatefulPartitionedCall/span30_1_1/spab1_6_1/conv3xc_21_1/conv2d_23_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}]}}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_6_1/activation_6_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/span30_1_1/spab1_6_1/conv3xc_21_1/conv2d_23_1/convolution"], "attr": {"T": {"type": "DT_FLOAT"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}]}}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_6_1/activation_6_1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/span30_1_1/spab1_6_1/conv3xc_21_1/conv2d_23_1/convolution", "StatefulPartitionedCall/span30_1_1/spab1_6_1/activation_6_1/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_6_1/conv3xc_22_1/conv2d_24_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/span30_1_1/spab1_6_1/activation_6_1/mul_1", "StatefulPartitionedCall/span30_1_1/spab1_6_1/conv3xc_22_1/conv2d_24_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_6_1/activation_6_3/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/span30_1_1/spab1_6_1/conv3xc_22_1/conv2d_24_1/convolution"], "attr": {"T": {"type": "DT_FLOAT"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}]}}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_6_1/activation_6_3/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/span30_1_1/spab1_6_1/conv3xc_22_1/conv2d_24_1/convolution", "StatefulPartitionedCall/span30_1_1/spab1_6_1/activation_6_3/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_6_1/conv3xc_23_1/conv2d_25_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/span30_1_1/spab1_6_1/activation_6_3/mul_1", "StatefulPartitionedCall/span30_1_1/spab1_6_1/conv3xc_23_1/conv2d_25_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}]}}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_6_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/span30_1_1/spab1_6_1/conv3xc_23_1/conv2d_25_1/convolution"], "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_6_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/span30_1_1/spab1_6_1/conv3xc_23_1/conv2d_25_1/convolution", "StatefulPartitionedCall/span30_1_1/conv3xc_20_1/conv2d_22_1/convolution"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_6_1/sub", "op": "Sub", "input": ["StatefulPartitionedCall/span30_1_1/spab1_6_1/Sigmoid", "StatefulPartitionedCall/span30_1_1/spab1_6_1/sub/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_6_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/span30_1_1/spab1_6_1/add", "StatefulPartitionedCall/span30_1_1/spab1_6_1/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_7_1/conv3xc_24_1/conv2d_26_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/span30_1_1/spab1_6_1/mul", "StatefulPartitionedCall/span30_1_1/spab1_7_1/conv3xc_24_1/conv2d_26_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_7_1/activation_7_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/span30_1_1/spab1_7_1/conv3xc_24_1/conv2d_26_1/convolution"], "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_7_1/activation_7_1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/span30_1_1/spab1_7_1/conv3xc_24_1/conv2d_26_1/convolution", "StatefulPartitionedCall/span30_1_1/spab1_7_1/activation_7_1/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_7_1/conv3xc_25_1/conv2d_27_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/span30_1_1/spab1_7_1/activation_7_1/mul_1", "StatefulPartitionedCall/span30_1_1/spab1_7_1/conv3xc_25_1/conv2d_27_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_7_1/activation_7_3/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/span30_1_1/spab1_7_1/conv3xc_25_1/conv2d_27_1/convolution"], "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_7_1/activation_7_3/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/span30_1_1/spab1_7_1/conv3xc_25_1/conv2d_27_1/convolution", "StatefulPartitionedCall/span30_1_1/spab1_7_1/activation_7_3/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_7_1/conv3xc_26_1/conv2d_28_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/span30_1_1/spab1_7_1/activation_7_3/mul_1", "StatefulPartitionedCall/span30_1_1/spab1_7_1/conv3xc_26_1/conv2d_28_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}]}}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_7_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/span30_1_1/spab1_7_1/conv3xc_26_1/conv2d_28_1/convolution"], "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_7_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/span30_1_1/spab1_7_1/conv3xc_26_1/conv2d_28_1/convolution", "StatefulPartitionedCall/span30_1_1/spab1_6_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_7_1/sub", "op": "Sub", "input": ["StatefulPartitionedCall/span30_1_1/spab1_7_1/Sigmoid", "StatefulPartitionedCall/span30_1_1/spab1_7_1/sub/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_7_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/span30_1_1/spab1_7_1/add", "StatefulPartitionedCall/span30_1_1/spab1_7_1/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_8_1/conv3xc_27_1/conv2d_29_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/span30_1_1/spab1_7_1/mul", "StatefulPartitionedCall/span30_1_1/spab1_8_1/conv3xc_27_1/conv2d_29_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_8_1/activation_8_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/span30_1_1/spab1_8_1/conv3xc_27_1/conv2d_29_1/convolution"], "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_8_1/activation_8_1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/span30_1_1/spab1_8_1/conv3xc_27_1/conv2d_29_1/convolution", "StatefulPartitionedCall/span30_1_1/spab1_8_1/activation_8_1/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_8_1/conv3xc_28_1/conv2d_30_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/span30_1_1/spab1_8_1/activation_8_1/mul_1", "StatefulPartitionedCall/span30_1_1/spab1_8_1/conv3xc_28_1/conv2d_30_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}]}}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_8_1/activation_8_3/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/span30_1_1/spab1_8_1/conv3xc_28_1/conv2d_30_1/convolution"], "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_8_1/activation_8_3/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/span30_1_1/spab1_8_1/conv3xc_28_1/conv2d_30_1/convolution", "StatefulPartitionedCall/span30_1_1/spab1_8_1/activation_8_3/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_8_1/conv3xc_29_1/conv2d_31_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/span30_1_1/spab1_8_1/activation_8_3/mul_1", "StatefulPartitionedCall/span30_1_1/spab1_8_1/conv3xc_29_1/conv2d_31_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}]}}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_8_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/span30_1_1/spab1_8_1/conv3xc_29_1/conv2d_31_1/convolution"], "attr": {"T": {"type": "DT_FLOAT"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}]}}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_8_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/span30_1_1/spab1_8_1/conv3xc_29_1/conv2d_31_1/convolution", "StatefulPartitionedCall/span30_1_1/spab1_7_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_8_1/sub", "op": "Sub", "input": ["StatefulPartitionedCall/span30_1_1/spab1_8_1/Sigmoid", "StatefulPartitionedCall/span30_1_1/spab1_8_1/sub/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_8_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/span30_1_1/spab1_8_1/add", "StatefulPartitionedCall/span30_1_1/spab1_8_1/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_9_1/conv3xc_30_1/conv2d_32_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/span30_1_1/spab1_8_1/mul", "StatefulPartitionedCall/span30_1_1/spab1_9_1/conv3xc_30_1/conv2d_32_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}]}}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_9_1/activation_9_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/span30_1_1/spab1_9_1/conv3xc_30_1/conv2d_32_1/convolution"], "attr": {"T": {"type": "DT_FLOAT"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}]}}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_9_1/activation_9_1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/span30_1_1/spab1_9_1/conv3xc_30_1/conv2d_32_1/convolution", "StatefulPartitionedCall/span30_1_1/spab1_9_1/activation_9_1/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_9_1/conv3xc_31_1/conv2d_33_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/span30_1_1/spab1_9_1/activation_9_1/mul_1", "StatefulPartitionedCall/span30_1_1/spab1_9_1/conv3xc_31_1/conv2d_33_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}]}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_9_1/activation_9_3/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/span30_1_1/spab1_9_1/conv3xc_31_1/conv2d_33_1/convolution"], "attr": {"T": {"type": "DT_FLOAT"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}]}}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_9_1/activation_9_3/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/span30_1_1/spab1_9_1/conv3xc_31_1/conv2d_33_1/convolution", "StatefulPartitionedCall/span30_1_1/spab1_9_1/activation_9_3/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_9_1/conv3xc_32_1/conv2d_34_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/span30_1_1/spab1_9_1/activation_9_3/mul_1", "StatefulPartitionedCall/span30_1_1/spab1_9_1/conv3xc_32_1/conv2d_34_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}]}}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_9_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/span30_1_1/spab1_9_1/conv3xc_32_1/conv2d_34_1/convolution"], "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_9_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/span30_1_1/spab1_9_1/conv3xc_32_1/conv2d_34_1/convolution", "StatefulPartitionedCall/span30_1_1/spab1_8_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_9_1/sub", "op": "Sub", "input": ["StatefulPartitionedCall/span30_1_1/spab1_9_1/Sigmoid", "StatefulPartitionedCall/span30_1_1/spab1_9_1/sub/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_9_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/span30_1_1/spab1_9_1/add", "StatefulPartitionedCall/span30_1_1/spab1_9_1/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_10_1/conv3xc_33_1/conv2d_35_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/span30_1_1/spab1_9_1/mul", "StatefulPartitionedCall/span30_1_1/spab1_10_1/conv3xc_33_1/conv2d_35_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_10_1/activation_10_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/span30_1_1/spab1_10_1/conv3xc_33_1/conv2d_35_1/convolution"], "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_10_1/activation_10_1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/span30_1_1/spab1_10_1/conv3xc_33_1/conv2d_35_1/convolution", "StatefulPartitionedCall/span30_1_1/spab1_10_1/activation_10_1/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_10_1/conv3xc_34_1/conv2d_36_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/span30_1_1/spab1_10_1/activation_10_1/mul_1", "StatefulPartitionedCall/span30_1_1/spab1_10_1/conv3xc_34_1/conv2d_36_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_10_1/activation_10_3/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/span30_1_1/spab1_10_1/conv3xc_34_1/conv2d_36_1/convolution"], "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_10_1/activation_10_3/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/span30_1_1/spab1_10_1/conv3xc_34_1/conv2d_36_1/convolution", "StatefulPartitionedCall/span30_1_1/spab1_10_1/activation_10_3/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_10_1/conv3xc_35_1/conv2d_37_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/span30_1_1/spab1_10_1/activation_10_3/mul_1", "StatefulPartitionedCall/span30_1_1/spab1_10_1/conv3xc_35_1/conv2d_37_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}]}}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_10_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/span30_1_1/spab1_10_1/conv3xc_35_1/conv2d_37_1/convolution"], "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_10_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/span30_1_1/spab1_10_1/conv3xc_35_1/conv2d_37_1/convolution", "StatefulPartitionedCall/span30_1_1/spab1_9_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_10_1/sub", "op": "Sub", "input": ["StatefulPartitionedCall/span30_1_1/spab1_10_1/Sigmoid", "StatefulPartitionedCall/span30_1_1/spab1_10_1/sub/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_10_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/span30_1_1/spab1_10_1/add", "StatefulPartitionedCall/span30_1_1/spab1_10_1/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_11_1/conv3xc_36_1/conv2d_38_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/span30_1_1/spab1_10_1/mul", "StatefulPartitionedCall/span30_1_1/spab1_11_1/conv3xc_36_1/conv2d_38_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_11_1/activation_11_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/span30_1_1/spab1_11_1/conv3xc_36_1/conv2d_38_1/convolution"], "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_11_1/activation_11_1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/span30_1_1/spab1_11_1/conv3xc_36_1/conv2d_38_1/convolution", "StatefulPartitionedCall/span30_1_1/spab1_11_1/activation_11_1/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_11_1/conv3xc_37_1/conv2d_39_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/span30_1_1/spab1_11_1/activation_11_1/mul_1", "StatefulPartitionedCall/span30_1_1/spab1_11_1/conv3xc_37_1/conv2d_39_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}]}}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_11_1/activation_11_3/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/span30_1_1/spab1_11_1/conv3xc_37_1/conv2d_39_1/convolution"], "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_11_1/activation_11_3/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/span30_1_1/spab1_11_1/conv3xc_37_1/conv2d_39_1/convolution", "StatefulPartitionedCall/span30_1_1/spab1_11_1/activation_11_3/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_11_1/conv3xc_38_1/conv2d_40_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/span30_1_1/spab1_11_1/activation_11_3/mul_1", "StatefulPartitionedCall/span30_1_1/spab1_11_1/conv3xc_38_1/conv2d_40_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}]}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_11_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/span30_1_1/spab1_11_1/conv3xc_38_1/conv2d_40_1/convolution"], "attr": {"T": {"type": "DT_FLOAT"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}]}}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_11_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/span30_1_1/spab1_11_1/conv3xc_38_1/conv2d_40_1/convolution", "StatefulPartitionedCall/span30_1_1/spab1_10_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_11_1/sub", "op": "Sub", "input": ["StatefulPartitionedCall/span30_1_1/spab1_11_1/Sigmoid", "StatefulPartitionedCall/span30_1_1/spab1_11_1/sub/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_11_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/span30_1_1/spab1_11_1/add", "StatefulPartitionedCall/span30_1_1/spab1_11_1/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/conv3xc_39_1/conv2d_42_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/span30_1_1/spab1_11_1/mul", "StatefulPartitionedCall/span30_1_1/conv3xc_39_1/conv2d_42_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "28"}]}]}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/span30_1_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/span30_1_1/conv3xc_20_1/conv2d_22_1/convolution", "StatefulPartitionedCall/span30_1_1/conv3xc_39_1/conv2d_42_1/convolution", "StatefulPartitionedCall/span30_1_1/spab1_6_1/mul", "StatefulPartitionedCall/span30_1_1/spab1_10_1/conv3xc_33_1/conv2d_35_1/convolution", "StatefulPartitionedCall/span30_1_1/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "N": {"i": "4"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/conv_layer_2_1/conv2d_41_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/span30_1_1/concat", "StatefulPartitionedCall/span30_1_1/conv_layer_2_1/conv2d_41_1/convolution/ReadVariableOp", "StatefulPartitionedCall/span30_1_1/conv_layer_2_1/conv2d_41_1/Squeeze"], "device": "/device:CPU:0", "attr": {"TArgs": {"list": {"type": ["DT_FLOAT"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "112"}]}, {"dim": [{"size": "1"}, {"size": "1"}, {"size": "112"}, {"size": "28"}]}]}}, "epsilon": {"f": 0.0}, "filter_format": {"s": "SFdJTw=="}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "leakyrelu_alpha": {"f": 0.2}, "data_format": {"s": "TkhXQw=="}, "num_host_args": {"i": "0"}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/span30_1_1/pixel_shuffle_block_1_1/conv_layer_3_1/conv2d_43_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/span30_1_1/conv_layer_2_1/conv2d_41_1/BiasAdd", "StatefulPartitionedCall/span30_1_1/pixel_shuffle_block_1_1/conv_layer_3_1/conv2d_43_1/convolution/ReadVariableOp", "StatefulPartitionedCall/span30_1_1/pixel_shuffle_block_1_1/conv_layer_3_1/conv2d_43_1/Squeeze"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "use_cudnn_on_gpu": {"b": true}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "28"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "28"}, {"size": "48"}]}]}}, "leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_host_args": {"i": "0"}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/span30_1_1/pixel_shuffle_block_1_1/DepthToSpace", "op": "DepthToSpace", "input": ["StatefulPartitionedCall/span30_1_1/pixel_shuffle_block_1_1/conv_layer_3_1/conv2d_43_1/BiasAdd"], "attr": {"block_size": {"i": "4"}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/span30_1_1/pixel_shuffle_block_1_1/DepthToSpace"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1994}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/span30_1_1/spab1_10_1/conv3xc_34_1/conv2d_36_1/convolution/ReadVariableOp", "shape": [3, 3, 28, 28], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_10_1/conv3xc_35_1/conv2d_37_1/convolution/ReadVariableOp", "shape": [3, 3, 28, 28], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_10_1/sub/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_11_1/conv3xc_36_1/conv2d_38_1/convolution/ReadVariableOp", "shape": [3, 3, 28, 28], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_11_1/conv3xc_37_1/conv2d_39_1/convolution/ReadVariableOp", "shape": [3, 3, 28, 28], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_11_1/conv3xc_38_1/conv2d_40_1/convolution/ReadVariableOp", "shape": [3, 3, 28, 28], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_11_1/sub/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_1_1/conv3xc_39_1/conv2d_42_1/convolution/ReadVariableOp", "shape": [3, 3, 28, 28], "dtype": "float32"}, {"name": "unknown", "shape": [1, 1, 1, 3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_1_1/conv3xc_20_1/conv2d_22_1/convolution/ArithmeticOptimizer/FoldMultiplyIntoConv_scaled_StatefulPartitionedCall/span30_1_1/conv3xc_20_1/conv2d_22_1/convolution_ReadVariableOp", "shape": [3, 3, 3, 28], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_6_1/conv3xc_21_1/conv2d_23_1/convolution/ReadVariableOp", "shape": [3, 3, 28, 28], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_6_1/conv3xc_22_1/conv2d_24_1/convolution/ReadVariableOp", "shape": [3, 3, 28, 28], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_6_1/conv3xc_23_1/conv2d_25_1/convolution/ReadVariableOp", "shape": [3, 3, 28, 28], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_6_1/sub/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_7_1/conv3xc_24_1/conv2d_26_1/convolution/ReadVariableOp", "shape": [3, 3, 28, 28], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_7_1/conv3xc_25_1/conv2d_27_1/convolution/ReadVariableOp", "shape": [3, 3, 28, 28], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_7_1/conv3xc_26_1/conv2d_28_1/convolution/ReadVariableOp", "shape": [3, 3, 28, 28], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_7_1/sub/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_8_1/conv3xc_27_1/conv2d_29_1/convolution/ReadVariableOp", "shape": [3, 3, 28, 28], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_8_1/conv3xc_28_1/conv2d_30_1/convolution/ReadVariableOp", "shape": [3, 3, 28, 28], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_8_1/conv3xc_29_1/conv2d_31_1/convolution/ReadVariableOp", "shape": [3, 3, 28, 28], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_8_1/sub/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_9_1/conv3xc_30_1/conv2d_32_1/convolution/ReadVariableOp", "shape": [3, 3, 28, 28], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_9_1/conv3xc_31_1/conv2d_33_1/convolution/ReadVariableOp", "shape": [3, 3, 28, 28], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_9_1/conv3xc_32_1/conv2d_34_1/convolution/ReadVariableOp", "shape": [3, 3, 28, 28], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_9_1/sub/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_1_1/spab1_10_1/conv3xc_33_1/conv2d_35_1/convolution/ReadVariableOp", "shape": [3, 3, 28, 28], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_1_1/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/span30_1_1/conv_layer_2_1/conv2d_41_1/convolution/ReadVariableOp", "shape": [1, 1, 112, 28], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_1_1/conv_layer_2_1/conv2d_41_1/Squeeze", "shape": [28], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_1_1/pixel_shuffle_block_1_1/conv_layer_3_1/conv2d_43_1/convolution/ReadVariableOp", "shape": [3, 3, 28, 48], "dtype": "float32"}, {"name": "StatefulPartitionedCall/span30_1_1/pixel_shuffle_block_1_1/conv_layer_3_1/conv2d_43_1/Squeeze", "shape": [48], "dtype": "float32"}]}]}